## OpenTofu Plan

**Environment:** `dev`
**Directory:** `./1_platform_management/environments/dev`

<details>
<summary>Show Plan Output</summary>

```hcl
data.azurerm_billing_mca_account_scope.billing["platform"]: Reading...
data.azurerm_management_group.tenant_root: Reading...
data.azurerm_billing_mca_account_scope.billing["platform"]: Read complete after 0s [id=/providers/Microsoft.Billing/billingAccounts/ffbe90e4-4c92-51f3-62db-7a172bf13a15:6bd78d7c-050e-43d3-b328-5b78d77bd526_2019-05-31/billingProfiles/DYXR-KFLN-BG7-PGB/invoiceSections/VD3P-IQFM-PJA-PGB]
data.azurerm_management_group.tenant_root: Read complete after 0s [id=/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_management_group_policy_assignment.platform_connectivity_deny_delete will be created
  + resource "azurerm_management_group_policy_assignment" "platform_connectivity_deny_delete" {
      + description          = "Prevents deletion of any resources under platform connectivity management group"
      + display_name         = "Deny Delete - Platform Connectivity"
      + enforce              = true
      + id                   = (known after apply)
      + management_group_id  = (known after apply)
      + metadata             = (known after apply)
      + name                 = "deny-del-pl-connectivity"
      + policy_definition_id = (known after apply)
    }

  # module.management_management_group.azurerm_management_group.this will be created
  + resource "azurerm_management_group" "this" {
      + display_name               = "mg-pl-management-dev-na-01"
      + id                         = (known after apply)
      + name                       = "mg-pl-management-dev-na-01"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # module.management_subscription_association.azurerm_management_group_subscription_association.this will be created
  + resource "azurerm_management_group_subscription_association" "this" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = "/subscriptions/9312c5c5-b089-4b62-bb90-0d92d421d66c"
    }

  # module.platform_connectivity_management_group.azurerm_management_group.this will be created
  + resource "azurerm_management_group" "this" {
      + display_name               = "mg-pl-platform-connectivity-dev-na-01"
      + id                         = (known after apply)
      + name                       = "mg-pl-platform-connectivity-dev-na-01"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # module.platform_connectivity_subscription.azurerm_management_group_subscription_association.this will be created
  + resource "azurerm_management_group_subscription_association" "this" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = (known after apply)
    }

  # module.platform_connectivity_subscription.azurerm_subscription.this will be created
  + resource "azurerm_subscription" "this" {
      + alias             = "pl-connectivity-dev-na-01"
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/ffbe90e4-4c92-51f3-62db-7a172bf13a15:6bd78d7c-050e-43d3-b328-5b78d77bd526_2019-05-31/billingProfiles/DYXR-KFLN-BG7-PGB/invoiceSections/VD3P-IQFM-PJA-PGB"
      + id                = (known after apply)
      + subscription_id   = (known after apply)
      + subscription_name = "pl-connectivity-dev-na-01"
      + tags              = {
          + "cost_center" = "platform"
          + "environment" = "dev"
          + "managed_by"  = "opentofu"
          + "owner"       = "kvdb"
          + "project"     = "levendaal"
        }
      + tenant_id         = (known after apply)
    }

  # module.policy_deny_delete.azurerm_policy_definition.deny_delete will be created
  + resource "azurerm_policy_definition" "deny_delete" {
      + description         = "This policy denies all delete operations on resources for maximum protection."
      + display_name        = "Deny Delete Operations - Deny Delete"
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"
      + metadata            = jsonencode(
            {
              + category = "Protection"
              + version  = "1.0.0"
            }
        )
      + mode                = "All"
      + name                = "deny-delete-deny-delete"
      + policy_rule         = jsonencode(
            {
              + if   = {
                  + allOf = [
                      + {
                          + exists = "true"
                          + field  = "type"
                        },
                    ]
                }
              + then = {
                  + details = {
                      + actionNames = [
                          + "delete",
                        ]
                    }
                  + effect  = "denyAction"
                }
            }
        )
      + policy_type         = "Custom"
      + role_definition_ids = (known after apply)
    }

  # module.sandbox_management_group.azurerm_management_group.this will be created
  + resource "azurerm_management_group" "this" {
      + display_name               = "sandbox"
      + id                         = (known after apply)
      + name                       = "mg-sandbox-dev-na-01"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + environment_info                    = {
      + environment = "dev"
      + tenant_id   = "90d27970-b92c-43dc-9935-1ed557d8e20e"
    }
  + management_management_group         = {
      + display_name = "mg-pl-management-dev-na-01"
      + id           = (known after apply)
      + name         = "mg-pl-management-dev-na-01"
    }
  + management_subscription_association = {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = "/subscriptions/9312c5c5-b089-4b62-bb90-0d92d421d66c"
    }
  + sandbox_management_group            = {
      + display_name = "sandbox"
      + id           = (known after apply)
      + name         = "mg-sandbox-dev-na-01"
    }
  + tenant_root_management_group_id     = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/_temp/tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "/home/runner/work/_temp/tfplan"
Releasing state lock. This may take a few moments...
```

</details>

*Triggered by @KrijnvanderBurg in commit 2d90e0638ac987c7b9a25581a762d119b5426d64*